In [27]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.26.4

In [28]:
n_baris = 10
n_kolom = 5
header = tuple("ABCDE")

df = pd.DataFrame(np.random.randint(1, 10, size=(n_baris, n_kolom)), columns=header)

df.add_prefix('kolom_')
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        1        7        9        7        2
1        1        1        4        4        6
2        8        1        6        8        2
3        4        7        2        5        6
4        5        2        9        7        4
5        1        1        5        9        1
6        1        4        7        7        7
7        4        6        6        7        8
8        7        8        2        3        3
9        2        7        5        3        5

In [29]:
df[df['A'].isin([1, 3, 5, 7, 9])]

   A  B  C  D  E
0  1  7  9  7  2
1  1  1  4  4  6
4  5  2  9  7  4
5  1  1  5  9  1
6  1  4  7  7  7
8  7  8  2  3  3

In [30]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  1  7  9  7  2
1  1  1  4  4  6
5  1  1  5  9  1
6  1  4  7  7  7

In [31]:
# untuk kondisi tidak sama dengan (not) menggunakan tanda ~(negasi)

df[~df['A'].isin([1, 3, 5, 7, 9])]

   A  B  C  D  E
2  8  1  6  8  2
3  4  7  2  5  6
7  4  6  6  7  8
9  2  7  5  3  5